# SetComponentFollowTopWallPeaks

## Description
Sets the follow top wall peaks flag of a component in an object.

```pascal
FUNCTION SetComponentFollowTopWallPeaks(
				object             : HANDLE;
				componentIndex     : INTEGER;
				followTopWallPeaks : BOOLEAN) : BOOLEAN;
```

```python

def vs.SetComponentFollowTopWallPeaks(object, componentIndex, followTopWallPeaks):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a wall, round wall, Wall Style, or the Wall Preferences.|
|componentIndex|INTEGER|The index of the component.|
|followTopWallPeaks|BOOLEAN|Whether or not the component will follow top wall peaks.|

## See Also
VS Functions:
GetComponentFollowTopWallPeaks

## Version
Availability: from Vectorworks 2011
## Category
* Objects - Architectural